
// Товары количество при изменении.
// 
// Параметры:
//  Элемент - ПолеФормы - Элемент
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ТекстСообщения = "Изменилась Количество";
	
	ПересчетСтроки(ТекущиеДанные, ТекстСообщения);
	
КонецПроцедуры

// Пересчет строки.
// 
// Параметры:
//  СтрокаНоменклатуры - ДанныеФормыЭлементКоллекции - Строка номенклатуры
//  СообщениеПользователю - Строка - Сообщение пользователю
&НаКлиенте
Процедура ПересчетСтроки(СтрокаНоменклатуры, СообщениеПользователю)
	СтрокаНоменклатуры.Сумма = СтрокаНоменклатуры.Цена * СтрокаНоменклатуры.Количество;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = (СообщениеПользователю);
	Сообщение.Сообщить();
	
	Пользователь = ОписаниеПользователя();
КонецПроцедуры

// Описание пользователя.
// 
// Возвращаемое значение:
//  Структура - Описание пользователя:
// * Имя - Строка - 
// * ДатаРождения - Дата - 
// * Штатный - Булево - 
&НаКлиенте
Функция ОписаниеПользователя()
	Человек = Новый Структура;
	Человек.Вставить("Имя", "Антон");
	Человек.Вставить("ДатаРождения", ТекущаяДата());
	Человек.Вставить("Штатный", Истина);	

	Возврат Человек;
КонецФункции

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ТекстСообщения = "Изменилась цена";
	
	ПересчетСтроки(ТекущиеДанные, ТекстСообщения);
	
КонецПроцедуры
